INSERT INTO test.product_category (parent_id,name) VALUES
(NULL,'服装'),
(1,'男装'),
(2,'男上衣'),
(2,'男下衣'),
(1,'女装'),
(3,'男短袖'),
(3,'男外套'),
(4,'男休闲裤'),
(5,'女裙子'),
(NULL,'食品');
INSERT INTO test.product_category (parent_id,name) VALUES
(10,'生鲜'),
(10,'速食'),
(11,'牛肉'),
(11,'鸡肉'),
(11,'鸡蛋'),
(12,'火腿肠'),
(12,'方便面');

INSERT INTO test.product (category_id,name,price,stock,status) VALUES
(9,'女裙子111',500,27766,1),
(9,'女裙子222',600,27783,1),
(9,'女裙子333',2000,27929,1),
(7,'男羽绒外套111',300,27801,1),
(7,'男羽绒外套222',600,28107,1),
(8,'男休闲裤111',70,28338,1),
(8,'男休闲裤222',76,27844,1),
(8,'男休闲裤333',80,27824,1),
(6,'男短袖111',57,28136,1),
(6,'男短袖222',59,27892,1);
INSERT INTO test.product (category_id,name,price,stock,status) VALUES
(6,'男短袖333',53,27757,1),
(6,'男短袖444',77,28163,1),
(13,'牛肉111',45,27938,1),
(14,'鸡肉111',25,28295,1),
(15,'鸡蛋111',8,28284,1),
(16,'火腿肠111',2,27919,1),
(17,'方便面111',5,28314,1),
(14,'鸡肉222',30,28131,1),
(14,'鸡肉333',23,28303,1),
(13,'牛肉22',50,28219,1);
INSERT INTO test.product (category_id,name,price,stock,status) VALUES
(17,'方便面222',4,27954,1);